[
  {
    "Id": 1,
    "productId": 1,
    "rating": 5,
    "comment": "Absolutely love this phone! The camera quality is outstanding and the titanium build feels premium. Battery life easily lasts a full day of heavy use.",
    "author": "Sarah Johnson",
    "createdAt": "2024-01-15T10:30:00Z"
  },
  {
    "Id": 2,
    "productId": 1,
    "rating": 4,
    "comment": "Great phone overall, but quite expensive. The Action Button is a nice touch and Face ID works flawlessly. Camera night mode is impressive.",
    "author": "Mike Chen",
    "createdAt": "2024-01-10T14:20:00Z"
  },
  {
    "Id": 3,
    "productId": 1,
    "rating": 5,
    "comment": "Coming from Android, I'm impressed with the seamless ecosystem integration. The display is gorgeous and performance is buttery smooth.",
    "author": "Emma Rodriguez",
    "createdAt": "2024-01-05T16:45:00Z"
  },
  {
    "Id": 4,
    "productId": 2,
    "rating": 5,
    "comment": "The S Pen integration is phenomenal for productivity. Camera zoom is incredible - 100x zoom actually works! Galaxy AI features are genuinely useful.",
    "author": "David Kim",
    "createdAt": "2024-01-20T09:15:00Z"
  },
  {
    "Id": 5,
    "productId": 2,
    "rating": 4,
    "comment": "Solid flagship phone with excellent display and camera. Battery life is good but not exceptional. Build quality feels premium.",
    "author": "Lisa Wang",
    "createdAt": "2024-01-18T11:30:00Z"
  },
  {
    "Id": 6,
    "productId": 3,
    "rating": 5,
    "comment": "Pure Android experience is refreshing. Camera computational photography is magic - photos look professional with minimal effort.",
    "author": "James Wilson",
    "createdAt": "2024-01-22T13:45:00Z"
  },
  {
    "Id": 7,
    "productId": 3,
    "rating": 4,
    "comment": "Love the clean software and frequent updates. Magic Eraser and other AI features work surprisingly well. Good value for the price.",
    "author": "Maria Garcia",
    "createdAt": "2024-01-16T15:20:00Z"
  },
  {
    "Id": 8,
    "productId": 4,
    "rating": 4,
    "comment": "Fast charging is incredibly quick - 0 to 80% in under 30 minutes! Performance is flagship level and the display is beautiful.",
    "author": "Alex Thompson",
    "createdAt": "2024-01-14T12:10:00Z"
  },
  {
    "Id": 9,
    "productId": 4,
    "rating": 5,
    "comment": "Best value flagship in the market. OxygenOS feels close to stock Android with useful additions. Camera quality punches above its price.",
    "author": "Rachel Lee",
    "createdAt": "2024-01-12T08:55:00Z"
  },
  {
    "Id": 10,
    "productId": 5,
    "rating": 4,
    "comment": "Camera system is professional-grade with Leica partnership showing. Low light photography is exceptional. Build quality is solid.",
    "author": "Peter Zhang",
    "createdAt": "2024-01-08T17:30:00Z"
  },
  {
    "Id": 11,
    "productId": 7,
    "rating": 5,
    "comment": "Perfect size iPhone with all the essentials. Camera upgrade from previous generation is noticeable. USB-C is finally here!",
    "author": "Jennifer Brown",
    "createdAt": "2024-01-25T14:15:00Z"
  },
  {
    "Id": 12,
    "productId": 8,
    "rating": 4,
    "comment": "Compact flagship that doesn't compromise on features. Galaxy AI integration is seamless and actually useful in daily tasks.",
    "author": "Robert Martinez",
    "createdAt": "2024-01-23T10:40:00Z"
  },
  {
    "Id": 13,
    "productId": 9,
    "rating": 4,
    "comment": "Excellent camera performance for the price point. Stock Android experience with timely updates. Build quality feels premium.",
    "author": "Sophie Anderson",
    "createdAt": "2024-01-21T16:25:00Z"
  },
  {
    "Id": 14,
    "productId": 10,
    "rating": 5,
    "comment": "Incredible value for money! Performance rivals phones twice the price. Battery life is outstanding - easily 2 days of use.",
    "author": "Daniel Taylor",
    "createdAt": "2024-01-19T09:50:00Z"
  },
  {
    "Id": 15,
    "productId": 11,
    "rating": 4,
    "comment": "Compact form factor with flagship specs. Leica camera tuning produces natural-looking photos. Premium materials throughout.",
    "author": "Amanda White",
    "createdAt": "2024-01-17T13:05:00Z"
  }
]